m, d = int(input('Введите месяц рождения (1-12): ')), int(input('Введите день рождения: '))

dMonth = [22, 21, 19, 21, 21, 21, 22, 23, 24, 24, 24, 23]
cMonth = [31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
nMonth = ['козерог', 'водолей', 'рыбы', 'овен', 'телец', 'близнецы', 'рак', 'лев', 'дева', 'весы', 'скорпион', 'стрелец']

for i in range(1, len(cMonth) + 1):
    if i > 1 and i < 12:
        if (dMonth[i-1]+1 <= d <= cMonth[i-1] and i == m) or (1 <= d <= dMonth[i-1] and i-1 == m):
            print('Ваш знак зодиака - ' + nMonth[i])
    elif i == 1:
        if
   # elif i == 12:
        #if